In [181]:
import numpy as np
import pandas as pd

In [182]:
data=pd.read_csv(r'/home/ayushi/Downloads/Salary_Comparison.csv')
parity=pd.read_csv(r'/home/ayushi/Downloads/pppconverter-master/data.csv',header=None)
exchange=pd.read_csv(r'/home/ayushi/Downloads/Exchange_Rate3.csv')

In [183]:
data.shape

(21245, 5)

In [184]:
data.head()

   Unnamed: 0  OTE-Amount CTC-Currency Facility  Country  DataMartYear
0           0   1040388.0          INR             India          2015
1           1   6300138.0          INR             India          2015
2           2    696334.0          INR             India          2015
3           3   1297338.0          INR             India          2015
4           4   2418624.0          INR             India          2015

In [190]:
data.columns

Index(['Unnamed: 0', 'OTE-Amount', 'CTC-Currency', 'Facility  Country',
       'DataMartYear'],
      dtype='object')

In [191]:
data.columns=['Unnamed: 0', 'OTE-Amount', 'CTC-Currency', 'Facility_Country',
       'DataMartYear']

In [192]:
parity.head()

                Country Currency  Year    PPP_Rate
0                 Aruba      ABW  2016    1.520866
1           Afghanistan      AFG  2016   20.170216
2                Angola      AGO  2016  132.333771
3               Albania      ALB  2016   55.186869
4  United Arab Emirates      ARE  2016    2.806145

In [193]:
parity.columns=['Country','Currency','Year','PPP_Rate']

In [194]:
data=data.merge(parity[['Country','PPP_Rate']], left_on ='Facility_Country',right_on = 'Country', how='left')

In [197]:
data.head()

,Unnamed: 0,OTE-Amount,CTC-Currency,Facility_Country,DataMartYear,Country,PPP_Rate
0,0,1040388.0,INR,India,2015,India,19.978078
1,1,6300138.0,INR,India,2015,India,19.978078
2,2,696334.0,INR,India,2015,India,19.978078
3,3,1297338.0,INR,India,2015,India,19.978078
4,4,2418624.0,INR,India,2015,India,19.978078

In [198]:
data.drop(['Facility_Country'],axis=1,inplace=True)

In [199]:
data=data.merge(exchange, left_on ='Country',right_on ='Location', how='left')

In [203]:
data.head()

,Unnamed: 0,OTE-Amount,CTC-Currency,DataMartYear,Country,PPP_Rate,Exchange_Rate,Updated_Income_in_USD
0,0,1040388.0,INR,2015,India,19.978078,65.122,0
1,1,6300138.0,INR,2015,India,19.978078,65.122,0
2,2,696334.0,INR,2015,India,19.978078,65.122,0
3,3,1297338.0,INR,2015,India,19.978078,65.122,0
4,4,2418624.0,INR,2015,India,19.978078,65.122,0

In [204]:
data['Updated_Income_in_USD']=0

In [206]:
data.drop(['Location'],axis=1,inplace=True)

In [207]:
data['Exchange_Rate']=pd.to_numeric(data['Exchange_Rate'], errors='coerce')

In [208]:
data.columns

Index(['Unnamed: 0', 'OTE-Amount', 'CTC-Currency', 'DataMartYear', 'Country',
       'PPP_Rate', 'Exchange_Rate', 'Updated_Income_in_USD'],
      dtype='object')

In [209]:
data['Updated_Income_in_USD']=data['OTE-Amount']*data['Exchange_Rate']

In [210]:
data['PPP/MER']=1

In [212]:
data['PPP/MER']=data['PPP_Rate']/data['Exchange_Rate'] #adjusting factor

In [213]:
data.head()

,Unnamed: 0,OTE-Amount,CTC-Currency,DataMartYear,Country,PPP_Rate,Exchange_Rate,Updated_Income_in_USD,PPP/MER
0,0,1040388.0,INR,2015,India,19.978078,65.122,6.775215e+07,0.306779
1,1,6300138.0,INR,2015,India,19.978078,65.122,4.102776e+08,0.306779
2,2,696334.0,INR,2015,India,19.978078,65.122,4.534666e+07,0.306779
3,3,1297338.0,INR,2015,India,19.978078,65.122,8.448525e+07,0.306779
4,4,2418624.0,INR,2015,India,19.978078,65.122,1.575056e+08,0.306779

In [214]:
data['Actual_Salary']=0

In [218]:
data['Actual_Salary']=data['OTE-Amount']/data['PPP/MER'] # dividing by adjusting factor

In [220]:
data.head()

,Unnamed: 0,OTE-Amount,CTC-Currency,DataMartYear,Country,PPP_Rate,Exchange_Rate,Updated_Income_in_USD,PPP/MER,Actual_Salary
0,0,1040388.0,INR,2015,India,19.978078,65.122,6.775215e+07,0.306779,3.391325e+06
1,1,6300138.0,INR,2015,India,19.978078,65.122,4.102776e+08,0.306779,2.053639e+07
2,2,696334.0,INR,2015,India,19.978078,65.122,4.534666e+07,0.306779,2.269821e+06
3,3,1297338.0,INR,2015,India,19.978078,65.122,8.448525e+07,0.306779,4.228897e+06
4,4,2418624.0,INR,2015,India,19.978078,65.122,1.575056e+08,0.306779,7.883923e+06

In [221]:
 data.to_csv('Salary1.csv')